{
  "basics": {
    "name": "Kevin Trethewey",
    "label": "Software Engineering Leader",
    "picture": "/assets/img/kevint-128-128.jpg",
    "email": "",
    "phone": "+27 (0) 82 579-9154",
    "website": "https://linktr.ee/kevintrethewey",
    "summary": "Over the course of my career I have had the opportunity to work in and observe projects, teams and organisations in vastly different environments, and seen vastly differing levels of success amongst them. Through my experiences I have grown an understanding of the values, principles and practices that are required for healthy systems, as well as gained deep experience in how to bring these into organisations as a technical leader.",
    "location": {
      "address": "Sandton",
      "postalCode": "2146",
      "city": "Johannesburg",
      "countryCode": "ZA",
      "region": "Gauteng"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "kevintrethewey",
        "url": "http://twitter.com/kevintrethewey"
      },
      {
        "network": "LinkedIn",
        "username": "kevint",
        "url": "https://www.linkedin.com/in/kevint"
      }
    ]
  },
  "work": [
    {
      "company": "Sand Technologies, EnterpriseAI",
      "position": "Head of Engineering & Platform",
      "website": "https://www.sandtech.com/",
      "startDate": "2020-07-31",
      "endDate": "Today",
      "summary": "SandTech's EnterpriseAI division builds AI-driven software and digital twins for global companies.",
      "highlights": [
        "Built a world class, remote-first and globally distributed software engineering capabilty from the ground up",
        "Delivered complex, cloud native, data intensive applications and services across mutiple cloud providers and technology stacks.",
        "Created and delivered a strategy for growing socio-technical data ecosystems at scale across multiple industry domains.",
     ]
    },
    {
      "company": "Jemstep by Invesco",
      "position": "Director of Engineering",
      "website": "https://www.jemstep.com",
      "startDate": "2018-01-01",
      "endDate": "2020-07-31",
      "summary": "Based in Silicon Valley, Jemstep is provides a digital investment advise product to large retail banks in the United States.",
      "highlights": [
        "Led software delivery teams across 3 continents and 4 time zones",
        "Delivered a complex, innovative fintech product to multiple large banking institutions in the USA.",
      ]
    },
    {
      "company": "Driven",
      "position": "Founder, Principle Consultant",
      "website": "https://drivenalliance.com",
      "startDate": "2008-03-01",
      "endDate": "2017-12-31",
      "summary": "Driven was a consulting and coaching organisation that provided corporate clients with access to deep technical skills and experience, whilst also being a very active supporter of the local development community",
      "highlights": [
        "Started the company in 2008",
        "Grew Driven to becoming a recognised name in South African software development circles",
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Coderetreat South Africa",
      "position": "Organiser, Sponsor",
      "website": "https://meetup.com/CodeRetreat",
      "startDate": "2012-03-01",
      "endDate": "today",
      "summary": "Local events in the style of the global CodeRetreat.org movement."
    },
    {
      "organization": "SisonkeRising",
      "position": "Organiser, Sponsor",
      "website": "http://sisonkerising.com/",
      "startDate": "2014-03-01",
      "endDate": "2016-12-01",
      "summary": "An impact and value driven community outreach programme that focused on teaching young people life skills through the vehicle of software developement."
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }    
  ],
  "interests": [
    {
      "name": "Pottery",
      "keywords": [
        "Ceramics",
        "Raku",
        "Wabi sabi"
      ]
    },
    {
      "name": "Model engines",
      "keywords": [
        "steam engines",
        "nitro engines",
        "model aircraft design and construction"
      ]
    },
    {
      "name": "Marine Reef Aquariums",
      "keywords": [
        "Marine Biology",
        "Chemistry",
        "Aquascaping"
      ]
    }    
  ],
  "references": [
    {
      "name": "Morag Evans",
      "reference": "I have the greatest respect for Kevin who continually impresses me both with his knowledge of his industry as well as his commitment to nurturing and growing developers. It has been a privilege working with him."
    },
    {
      "name": "Hendrik Briel",
      "reference": "Kevin may work in the technology field, but he believes results come from motivated well functioning teams. He has made a vast impact to the way technology is approached and implemented at my employer. We have had huge successes primarily as a result of Kevin's input."
    },
    {
      "name": "Daniel Cabral",
      "reference": "I thoroughly enjoyed Kevin's workshops and presentations at FirstRand. Kevin was instrumental in instilling a culture of unit testing and practicing other good software dev principles (eg. SOLID, agile, etc.) at FirstRand. He is passionate about software and I am sure he will continue to be a success."
    },
    {
      "name": "Tania van Wyk de Vries",
      "reference": "Kevin has very sound knowledge on technical practices related to writing good quality software. Is works very closely with developers and they always have a lot of respect for him due to the knowledge and approach he takes. An asset to any engagement."
    },
    {
      "name": "Johann de Swart",
      "reference": "Working with Kevin is as insightful as it is inspiring. He is driven and has an unending passion for teaching and driving others to teach. The breadth and depth of his technical and management knowledge far exceeds what has come to be the norm in our industry and this has pushed me to up my own game in terms of knowledge transfer and technical excellence. I would gladly work with him in the future."
    },
    {
      "name": "Cheri Way",
      "reference": "I worked with Kevin at De Beers. I found Kevin to have a wealth of technical knowledge which he is eager to share. He was early in the South African market to adopt the agile approach to development which is now becoming a mainstream movement. I am sure he will be a valueble asset to any company or team wanting to implement an agile approach to their development strategy."
    },
    {
      "name": "Chris Rheeder",
      "reference": "Kevin provided us with the insights needed to transform from a traditional 'waterfall approach' systems development team to an Agile SCRUM methodology that produced 3 times the output previously achieved. I have made use of Kevins services more than once and will most certainly recommend him."
    },
    {
      "name": "Paul Sainsbury",
      "reference": "Kevin has a keen eye for detail and a great ability to understand our business needs and provide training and solutions to meet them well."
    },
    {
      "name": "Ridz van Wyk de Vries",
      "reference": "Kevin is technically very astute, is pragmatic in his overall solution recommendations and really comes into his own in a team leadership/mentor role. Over the years I have become accustomed to handing him and his team a business problem, knowing that he will deliver the optimal solution with no intervention necessary."
    }
  ]

}
